app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title != '') ORDER BY release_date
---
  def index
    if !params[:sort_by].nil?
      session[:sort_by] = params[:sort_by]
    end


    if session["sort_by"] == "title"
      @title_class = 'hilite'
      @movies = Movie.order(session[:sort_by])